Tekla Open API Reference for Tekla Structures 2025
ReinforcementPulloutElement.Rotation Enumeration
 The rotation of the pull-out.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum Rotation
Public Enumeration Rotation
Members
Member name | Value | Description
Automatic | 0 |  Automatic rotation.
Plane | 1 |  Plane rotation.
Global | 2 |  Global 3D rotation.
See Also
Reference
Tekla.Structures.Drawing Namespace